[
  {
    "name": "Bitcoin",
    "paragraphs": "Bitcoin (abbreviation: BTC ; sign : ₿ ) is the first decentralized cryptocurrency. Based on a free-market ideology, bitcoin was invented in 2008 when an unknown entity published a white paper under the pseudonym of Satoshi Nakamoto. Use of bitcoin as a currency began in 2009, with the release of its open-source implementation. As bitcoin is pseudonymous , its use by criminals has attracted the attention of regulators.On 31 October 2008, a link to a white paper titled Bitcoin: A Peer-to-Peer Electronic Cash System was posted to a cryptography mailing list. On 3 January 2009, the bitcoin network was created when Nakamoto mined the starting block of the chain, known as the genesis block. On May 22, 2010, the first known commercial transaction using bitcoin occurred when programmer Laszlo Hanyecz bought two Papa John's pizzas for $10,000.In March 2013, the US Financial Crimes Enforcement Network (FinCEN) established regulatory guidelines for \"decentralized virtual currencies\" such as bitcoin. In May 2013, US authorities seized the unregistered exchange Mt. Gox. The FBI seized about ₿30,000 in October 2013 from Silk Road, following the arrest of its founder Ross Ulbricht. In February 2018, the price crashed after China imposed a complete ban on bitcoin trading.In September 2021, bitcoin became legal tender currency in El Salvador. In November 2021, the Taproot soft-fork upgrade was activated, adding support for Schnorr signatures. In December 2024, bitcoin price reached $100,000 for the first time, as US president-elect Donald Trump promised to make the US the \"crypto capital of the planet\" In March 2025, President Trump signed an executive order to establish a strategic bitcoin reserve. As of June 2023, River Financial estimated that bitcoin had 81.7 million users, about 1% of the global population.The unit of account of the bitcoin system is the bitcoin . It is most commonly represented with the symbol ₿ and the currency code BTC. One bitcoin is divisible to eight decimal places. Units for smaller amounts of bitcoin are the millibitcoin (mBTC) and the satoshi (sat), representing 1 ⁄ 100 000 000 (one hundred millionth) bitcoin. As a decentralized system, bitcoin operates without a central authority.In the blockchain, bitcoins are linked to specific strings called addresses. Most often, an address encodes a hash of a single public key. To use bitcoins, owners need their private key to digitally sign transactions. Losing a private key means losing access to the bitcoins, with no other proof of ownership accepted by the protocol. As of December 2017, approximately ₿980,000 had been stolen from cryptocurrency exchanges.The mining process in bitcoin involves maintaining the blockchain through computer processing power. Miners group and broadcast new transactions into blocks, which are then verified by the network. Each block must contain a proof of work (PoW) to be accepted, involving finding a nonce number that, combined with the block content, produces a hash numerically smaller than the network's difficulty target. As of December 2017, approximately ₿980,000 had been stolen from cryptocurrency exchanges.In the bitcoin network, each bitcoin is treated equally, ensuring basic fungibility. As more blocks are added, modifying older blocks becomes increasingly challenging. To tamper or censor the ledger, one needs to control the majority of the global hashrate. About half of the electricity used is generated through fossil fuels. The environmental impact of bitcoin mining is controversial, leading to restrictions or incentives in various jurisdictions.The first wallet program, simply named Bitcoin , was released in 2009 by Nakamoto as open-source software. Wallets can be full clients, with a full copy of the blockchain to check the validity of mined blocks. Third-party internet services store users' credentials on their servers, making them susceptible of hacks. Cold storage protects bitcoins by keeping private keys offline, either through specialized hardware wallets or paper printouts.The Economist describes bitcoin as \"a techno-anarchist project to create an online version of cash\" Money serves three purposes: a store of value , a medium of exchange , and a unit of account. The legal status of bitcoin varies substantially from one jurisdiction to another. The use of bitcoin by criminals has attracted the attention of financial regulators, legislative bodies, and law enforcement. As of November 2021 , nine countries applied an absolute ban (Algeria, Bangladesh, China, Egypt, Iraq, Morocco, Nepal, Qatar, and Tunisia)Bitcoin is used in regular transactions with merchants, but is popular in the informal economy and for criminal activities. Prices are not usually quoted in bitcoin and trades involve conversions into fiat currencies. Commonly cited reasons for not using bitcoin include high costs, the inability to process chargebacks, high price volatility and transaction fees. As of 2023, the US government owned more than $5 billion worth of seized bitcoin.As of 2018, the overwhelming majority of bitcoin transactions took place on cryptocurrency exchanges. Since 2014, regulated bitcoin funds also allow exposure to the asset or to futures as an investment. Bitcoin wealth is highly concentrated, with 0.01% holding 27% of in-circulation currency, as of 2021. As of September 2023, El Salvador had $76.5 million worth of bitcoin in its international reserves.Bitcoin is highly volatile and does not behave like any other conventional asset. The term hodl was created in December 2013 for holding bitcoin rather than selling it during periods of volatility. The daily transaction volume of bitcoin across all exchanges typically reaches $50 billion as of 2025. Bitcoin markets operate 24 hours a day, seven days a week, contrasting with traditional financial markets that have fixed trading hours. Bitcoin prices show much higher volatility and respond strongly to both regulatory changes and market events.",
    "url": "https://en.wikipedia.org//wiki/Bitcoin"
  },
  {
    "name": "XRP Ledger",
    "paragraphs": "The XRP Ledger (XRPL) is a cryptocurrency platform launched in 2012 by Ripple Labs. It employs the native cryptocurrency known as XRP, and supports tokens, cryptocurrency or other units of value such as frequent flyer miles or mobile minutes. In May 2018, Ashton Kutcher gifted a charity sponsored by Ellen DeGeneres $4 million in the currency, which was noted at the time to be the \"third most-valuable cryptocurrency on the market\" On March 2, 2025, President Donald Trump announced that XRP was one of five digital assets he intended to name to a planned U.S. crypto strategic reserve.The XRP Ledger peer-to-peer overlay network is characterized by a small-world network topology. Unlike many cryptocurrencies, XRP was pre-mined, with 100 billion tokens created at inception. The XRPL founders gifted 80 billion XRP, the platform's native currency, to Ripple Labs. Ripple Labs holds a portion of XRP and periodically releases tokens into circulation through sales.",
    "url": "https://en.wikipedia.org//wiki/Ripple_(payment_protocol)"
  },
  {
    "name": "Tether (cryptocurrency)",
    "paragraphs": "Tether is a cryptocurrency stablecoin launched by Tether Limited Inc. in 2014. It is pegged to the United States dollar, and is distinct from a central bank digital currency (CBDC) As of 1 August 2024, Tether reported having $118.4 billion in reserves, including $5.3 billion in excess reserves. Tether is the largest cryptocurrency in terms of trading volume, holding 70% of the market share among stablecoins.Realcoin worked with banks, digital-currency exchanges, and ATM providers to become \"gateways\" for buying, trading, or redeeming realcoins around the world. On 20 November 2014, Tether CEO Reeve Collins announced the project was being renamed to \"Tether\" In January 2015, the cryptocurrency exchange Bitfinex enabled trading of Tether on their platform. Tether issues tokens on Algorand, Avalanche, Celo, EOS, Near, Polygon, Solana, Bitcoin Cash 's Standard Ledger Protocol, Statemint, Tezos and Tron.From January 2017 to September 2018, the amount of tethers outstanding grew from about $10 million to about $2.8 billion. In early 2018, Tether accounted for about 10% of the trading volume of bitcoin, but during the summer of 2018, it accounted for up to 80% of bitcoin volume. Tether surpassed bitcoin in trading volume with the highest daily and monthly trading volumes of any cryptocurrency.In 2022, Tether remained strong during a time when several once-reputable companies in crypto and banking collapsed. Tether's nearest competitor, Circle , experienced a faltered growth to the point where its $24 billion of USDC was worth barely more than a quarter of Tether’s stash. In October 2023, Paolo Ardoino , the chief technology officer for Tether, was promoted to CEO.Tether was the most used stablecoin for criminal activity throughout 2023, having been connected to $19.3 billion in illicit transactions. In the first quarter of 2024, Tether's profit was $4.52 billion. U.S. Treasury securities were a major contributor to its net profits. Tether announced it would restructure into four divisions focused on artificial intelligence, bitcoin mining, education, and stablecoins.Tether reported a net operating profit of $1.3 billion during the second quarter alone. Tether reported that it holds more than $97.6 billion in U.S. Treasuries, making them one of the largest buyers of Treasury bills in the world. In October 2024, The Wall Street Journal reported Tether was the target of a federal criminal investigation for possible violations of sanctions and anti-money-laundering rules. In December 2024, Tether announced a $775 million investment in Rumble , an alternative video hosting platform known for its predominantly right-wing user base. In September 2025 former Trump administration official Bo Hines was named CEO of Tether US, the company's US arm.U.S. federal prosecutors are investigating whether Tether was used to manipulate the price of bitcoin. Tether can be newly issued by purchase for dollars or redeemed by exchanges and qualified corporate customers, excluding U.S.-based customers. In January 2018 Tether announced that they no longer had a relationship with their auditor. About $31 million USDT tokens were stolen from Tether in November 2017. Later analysis of the bitcoin distributed ledger showed a close connection between the Tether hack and the January 2015 hack of Bitstamp.In December 2023, Tether CEO Paolo Ardoino told members of House Financial Services and Senate Banking that the company has been strengthening its relationships with law enforcement. Tether reported that together with OKX , it had frozen $225 million worth of its cryptocurrency, which had been linked to a human trafficking group in Southeast Asia responsible for a global pig butchering scam. In March 2024, the U.S. Attorney based out of Chicago, and FBI Special Agent-in-Charge Robert W. \"Wes\" Wheeler, Jr. for its role in seizing $1.4 million of Tether linked to tech scam network.Tether has failed to present audits showing that the amount of tethers outstanding are backed one-to-one by United States dollars on deposit. A June 2018 attempt at an audit was posted on their website in June 2018 which showed a report by the law firm Freeh, Sporkin & Sullivan LLP (FSS), which appeared to confirm that dollars fully backed the issued tethers. If Tether were a country, it would be the 18th largest holder of U.S. debt among nations.iFinex settled legal dispute with New York Attorney General's office. iFinex, Bitfinex, and Tether Limited did not admit any wrongdoing and paid US$18.5 million to settle the case. New York Supreme Court Judge Joel M. Cohen granted i finex's motion to modify the injunction because the prosecution's case was \"couched in exceedingly sweeping terms\" and \"injunctions must be specific\"On 5 December 2017, the U.S. Commodity Futures Trading Commission (prosecution) issued subpoenas to Bitfinex and Tether Limited. On 15 October 2021, Tether paid a fine of US$41.6 million for inaccurately claiming that minted USD₮ were 100% backed by fiat USD. Tether continues to refuse to allow an independent audit to verify its claims of full backing.",
    "url": "https://en.wikipedia.org//wiki/Tether_(cryptocurrency)"
  },
  {
    "name": "Ethereum",
    "paragraphs": "Ether ( abbreviation : ETH ) is the native cryptocurrency of the platform. Among cryptocurrencies, ether is second only to bitcoin in market capitalization . It is open-source software . Ethereum was conceived in 2013 by programmer Vitalik Buterin . Other founders include Gavin Wood, Charles Hoskinson, Anthony Di Iorio, and Joseph Lubin. On 15 September 2022, Ethereum transitioned its consensus mechanism from proof-of-work (PoW) to proof- of-stake (PoS)Vitalik Buterin wanted his platform to be the underlying and imperceptible medium for the applications running on top of it. The idea of putting executable smart contracts in the blockchain needed to be specified before it could be implemented in software. Development was funded by an online public crowd sale from July to August 2014, in which participants bought the Ethereum value token (ether) with another digital currency, bitcoin.Several codenamed prototypes were developed over 18 months in 2014 and 2015 by the Ethereum Foundation as part of their proof-of-concept series. \"Olympic\" was the last prototype and public beta pre-release. In March 2017, various blockchain startups, research groups, and Fortune 500 companies announced the creation of the Enterprise Ethereum Alliance (EEA) with 30 founding members. By May 2017, the nonprofit organization had 116 enterprise members, including ConsenSys.In March 2017, various blockchain startups, research groups, and Fortune 500 companies announced the creation of the Enterprise Ethereum Alliance (EEA) By May 2017, the nonprofit organization had 116 enterprise members. By July 2017, there were over 150 members in the alliance, including MasterCard, Cisco Systems, Sberbank, and Scotiabank. In 2024, Paul Brody, EEA board member for EY, was announced as the new chairperson.In 2021, Visa Inc. announced that it began settling stablecoin transactions using Ethereum. JP Morgan Chase , UBS , and MasterCard announced that they were investing US$65 million into ConsenSys. On 27 August 2021, the blockchain experienced a brief fork that was the result of clients running different incompatible software versions. On 13 March 2024, \"Dencun\" or also \"Deneb-Cancun\" set of upgrades went live. The Prague-Electra (\"Pectra\") update was launched on 7 May 2025.Ethereum is a peer-to-peer network that processes state-altering transactions. Every 12 seconds, a batch of new transactions, known as a \"block\", is processed by the network. Each block contains a cryptographic hash identifying the series of blocks that must precede it if the block is to be considered valid. Each \"node\" connects with a relatively small subset of the network to offer blocks and unvalidated transactions to its peers.Ether (ETH) is the cryptocurrency generated in accordance with the Ethereum protocol as a reward to validators in a proof-of-stake system for adding blocks to the blockchain. A validator's attestation is given a weight equal to its stake or 2,048, whichever is less. ETH is the only currency accepted by the protocol as payment for the transaction fee. The base fee is \"burned\" (deleted from existence) and the tip goes to the block proposer. ETH may be \"sent\" from one account to another via a transaction.There are two types of accounts on Ethereum: user accounts (also known as externally-owned accounts), and contract accounts. Both types have an ETH balance, may transfer ETH to any account, may execute the code of another contract, or create a new contract. Contracts are the only type of account that has associated bytecode and storage (to store contract-specific state). The code of a contract is evaluated when a transaction is sent to it.Gas is a unit of account within the EVM used in the calculation of the transaction fee. A transaction may only be included in the blockchain at a block slot that has a base gas price less than or equal to the transaction's gas price. Gas prices are typically denominated in gigawei (Gwei), a subunit of ETH equal to 10 −9 ETH. The EVM's instruction set is Turing-complete. Popular uses have included the creation of fungible and non-fungible transactions.Smart contracts are written in high-level programming languages and then compiled down to EVM bytecode. Popular uses of Ethereum have included the creation of fungible (ERC-20) and non-fungible (RC-721) tokens with a variety of properties. ERC-20 Token Standard allows for fungible tokens on the Ethereum blockchain. Since tokens of this type are unique, they have been used to represent such things as collectibles, digital art, sports memorabilia and virtual real estate.Decentralized finance (DeFi) offers financial instruments in a decentralized architecture, outside of companies' and governments' control. DeFi applications are typically accessed through a Web3 -enabled browser extension or application, such as MetaMask. Some DeFi protocols allow synthetic versions of various assets (such as bitcoin, gold, and oil) to be tradeable on Ethereum. As of March 2025 , the maximum theoretical throughput for Ethereum is 142 TPS (given its current 36M gas limit, 12s blocks, and 21k gas cost for ETH transfers)As of January 2016, the Ethereum averaged about 25 transactions per second. The network has faced congestion problems, such as in 2017 in relation to CryptoKitties. The legal status of Ether (ETH) remains subject to uncertainty and varies substantially from one jurisdiction to another. In the United States, regulatory authorities have increasingly signaled that Ether should be treated as a commodity under the jurisdiction of the Commodity Futures Trading Commission.",
    "url": "https://en.wikipedia.org//wiki/Ethereum"
  },
  {
    "name": "Solana (blockchain platform)",
    "paragraphs": "Solana was founded in 2018 by Anatoly Yakovenko and Raj Gokal. The network was launched in March 2020 by their San Francisco-based company, Solana Labs. Designed to support decentralized applications and high-throughput transactions. The price of SOL grew by nearly 12,000% that year, reaching a market capitalization of over $70 billion. The platform has since faced challenges, including a major wallet hack in August 2022.SOL token has experienced several notable outages in service. On 3 August 2022, 9,231 Solana wallets were hacked and four Solana wallet addresses stole approximately $8 million from victims. In November 2022, the price of SOL token dropped by 40 percent in one day following the bankruptcy of FTX , due to sell off from Alameda Research. By the end of 2022, Solana had lost more than $50 billion in market capitalization. In January 2025, the SOL token reached a new all-time high of $294.Solana has experienced several notable outages in service. In January 2025, the SOL token reached a new all-time high of $294, following the launch of US President Donald Trump's memecoin. In November 2024, Robinhood Crypto relisted SOL for U.S. customers, alongside several other cryptocurrencies. Solana Mobile, a subsidiary of Solana Labs, began selling the Solana Saga, an Android smartphone with several Solana-based decentralized apps preinstalled.",
    "url": "https://en.wikipedia.org//wiki/Solana_(blockchain_platform)"
  }
]